auth/auth_backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def set_user
      if decode_token
        id = decode_token[0]['user_id']
        @user = User.find(id)