Rails_intro/intro/app/controllers/pokemon_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def index
        poke_list = Pokemon.all

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        pokemon = Pokemon.find(params[:id])

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_pokemon
        @pokemon = Pokemon.find(params[:id])